In [90]:
import pandas as pd
import numpy as np

In [91]:
train_ds = pd.DataFrame(
    {'Emp Name':['Mayank','Ali', 'Ram', 'Sameer', 'Sanjay T', 'Sanjay P', 'Priya', 'Parag', 'Amit', 'Lalit', 'Mohan'],
     'Age':[34,33,33,39,36,30,40,41,42,36,33],
     'Salary' : [80,88,120,120,110,140,160,80,100,90,83],
     'Technology':['Oracle', 'Tibco', 'PEGA', 'Oracle', 'SQL Server', 'Oracle', 'ALL', 'PEGA', 'NODE', 'ALL', 'JAVA'],
     'Left Company' : ['N','Y','N','Y','N','N','N','N','Y','N','N']
    })

In [92]:
train_ds

    Age  Emp Name Left Company  Salary  Technology
0    34    Mayank            N      80      Oracle
1    33       Ali            Y      88       Tibco
2    33       Ram            N     120        PEGA
3    39    Sameer            Y     120      Oracle
4    36  Sanjay T            N     110  SQL Server
5    30  Sanjay P            N     140      Oracle
6    40     Priya            N     160         ALL
7    41     Parag            N      80        PEGA
8    42      Amit            Y     100        NODE
9    36     Lalit            N      90         ALL
10   33     Mohan            N      83        JAVA

In [93]:
test_ds = pd.DataFrame(
    {'Emp Name':['Mayank2','Mayank3','Mayank1','Ali1', 'Ram1', 'Sameer1', 'Sanjay T1', 'Sanjay P1', 'Priya1', 'Parag1', 'Amit1', 'Lalit1', 'Mohan1'],
     'Age':[35,36,34,33,33,39,36,30,40,41,42,36,33],
     'Salary' : [100,98,88,83,120,120,100,140,160,80,110,90,88],
     'Technology':['PEGA', 'ALL','Oracle', 'Tibco', 'PEGA', 'Oracle', 'SQL Server', 'Oracle', 'ALL', 'PEGA', 'NODE', 'ALL', 'JAVA']
    })

In [94]:
test_ds

    Age   Emp Name  Salary  Technology
0    35    Mayank2     100        PEGA
1    36    Mayank3      98         ALL
2    34    Mayank1      88      Oracle
3    33       Ali1      83       Tibco
4    33       Ram1     120        PEGA
5    39    Sameer1     120      Oracle
6    36  Sanjay T1     100  SQL Server
7    30  Sanjay P1     140      Oracle
8    40     Priya1     160         ALL
9    41     Parag1      80        PEGA
10   42      Amit1     110        NODE
11   36     Lalit1      90         ALL
12   33     Mohan1      88        JAVA

In [95]:
from sklearn.tree import DecisionTreeClassifier

In [96]:
dtree = DecisionTreeClassifier()
X_train = train_ds[['Age','Salary']]
y = train_ds['Left Company']

print(X_train)
print(y)

    Age  Salary
0    34      80
1    33      88
2    33     120
3    39     120
4    36     110
5    30     140
6    40     160
7    41      80
8    42     100
9    36      90
10   33      83
0     N
1     Y
2     N
3     Y
4     N
5     N
6     N
7     N
8     Y
9     N
10    N
Name: Left Company, dtype: object

In [97]:
X_test = test_ds[['Age','Salary']]
X_test

    Age  Salary
0    35     100
1    36      98
2    34      88
3    33      83
4    33     120
5    39     120
6    36     100
7    30     140
8    40     160
9    41      80
10   42     110
11   36      90
12   33      88

In [98]:
dtree.fit(X_train,y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [99]:
prediction = dtree.predict(X_test)
prediction

array(['N', 'N', 'Y', 'N', 'N', 'Y', 'N', 'N', 'N', 'N', 'Y', 'N', 'Y'], dtype=object)

In [100]:
# dfPrediction = pd.DataFrame(data=prediction, index = test_ds.index.values,columns=['Left Company'])
dfPrediction = pd.DataFrame(data=prediction, index = test_ds['Salary'].values,columns=['Left Company'])
dfPrediction

    Left Company
100            N
98             N
88             Y
83             N
120            N
120            Y
100            N
140            N
160            N
80             N
110            Y
90             N
88             Y

In [101]:
from sklearn import metrics #Import scikit-learn metrics module for accuracy calculation
print("Accuracy:",metrics.accuracy_score(y, prediction))

ValueError: Found input variables with inconsistent numbers of samples: [11, 13]

In [ ]:
train_ds

In [ ]:
dfPrediction

In [ ]:
#Converting Categorial value (Technology) into Numeric type
Tech_num = {"Technology" : {"Oracle" : 1, "PEGA" : 2, "Tibco" : 3, "ALL" : 4, "SQL Server" : 5, "NODE" : 6, "JAVA" : 7}}
train_ds.replace(Tech_num, inplace = True)
print(train_ds)
test_ds.replace(Tech_num, inplace = True)
print(test_ds)

In [ ]:
dtree = DecisionTreeClassifier()
X_train = train_ds[['Age','Salary', 'Technology']]
y = train_ds['Left Company']
X_test = test_ds[['Age','Salary', 'Technology']]
dtree.fit(X_train,y)
prediction = dtree.predict(X_test)

# dfPrediction = pd.DataFrame(data=prediction, index = test_ds.index.values,columns=['Left Company'])
dfPrediction = pd.DataFrame(data=prediction, index = test_ds['Salary'].values,columns=['Left Company'])
print(dfPrediction)
print("Accuracy:",metrics.accuracy_score(y, prediction))
print(train_ds)

In [ ]:
#import pandas as pd
#import numpy as np
#dict = {'First Score':[100, 90, np.nan, 95], 
#        'Second Score': [30, 45, 56, np.nan], 
#        'Third Score':[np.nan, 40, 80, 98]}
#df = pd.DataFrame(dict)
#print(df)

#df.fillna(0)

#df.fillna(5)

In [ ]:
# Using interpolate() function to fill the missing values using linear method.
#df = pd.DataFrame({"A":[12, 4, 5, None, 1],  
#                   "B":[None, 2, 54, 3, None],  
#                   "C":[20, 16, None, 3, 8],  
#                   "D":[14, 3, None, None, 6]}) 
#print(df) 

#df.interpolate(method ='linear', limit_direction ='forward') 
#As we can see the output, values in the first row could not get filled as the direction of filling of values is forward and there is no previous value which could have been used in interpolation.

In [ ]:
# this function drop a row or record with at least one Nan value (Null value)
#df.dropna()

#This will drop a record or row whose all data is missing or contain null values(NaN)
#df.dropna(how = 'all')

# This will drop a columns which have at least 1 missing values
#df.dropna(axis = 1)

In [ ]:
# making new data frame with dropped NA values.
# Dropping Rows with at least 1 null value in CSV file
#new_data = data.dropna(axis = 0, how ='any')
#new_data.shape